org-pages/ideasx/nlp.org
#+TITLE: A different aproach to NLP and NLU


+ NLP serves as a way to run prebuild functions, and not to make it do something.
  - For it to be able to do something from the words you say
+ Running prebuild functions, there are usually more than 10 ways to trigger these to run:
  - Say for example, you wanna ask Alexa the wheather:
    - Alexa, what is the wheather today? - Works
    - Tell me about the wheather today - Works
    - I need some information on whether - Quite not the result I wanted
    - Alexa, am I gonna get wet? - Doesn't work
* NLP
** Problems
+ It provides no guarantee - No guarantee of the user receinving what he wants.
+ It can never perfectly understand human languages (eg. sarcasm)
+ It is hard to extend
+ One language dominance (e.g english)
* Create another language
- New ALI (Audio Language Interface)
- Completely undestandable by a computer:
  - There is only one way of input (which means no sarcasm, synonyms, irony, figure of speech)
  - Grammar is computer instructions
  - Language can be extensible
  - It should remove NLP current issues
** Benefits
+ It is realiable
+ Easy to be developed
+ It will provide a standard for programs and voice control supported will be added to every software
+ Easier for blind people to use computers

* New proposal: build a privacy respecting home
** Links
+ [[https://www.ctpost.com/business/article/Alexa-has-been-eavesdropping-on-you-this-whole-13822095.php][Alexa has been eavesdropping on you this whole time]]


[[https://www.smh.com.au/technology/alexa-is-someone-else-listening-to-us-sometimes-someone-is-20190411-p51d4g.html]['Alexa, is someone else listening to us?' Sometimes, someone is]]
[[https://www.bnnbloomberg.ca/amazon-s-alexa-reviewers-can-access-customers-home-addresses-1.1248788][Amazon's Alexa reviewers can access customers' home addresses]]
[[https://www.welivesecurity.com/2018/02/26/privacy-design-create-safe-smart-home/][Privacy by Design: Can you create a safe smart home?]]

"The sensors packed into Smart Home products – with their
microphones, cameras, interface with GPS, not to mention interoperability
– are juicy targets for malware attacks. By gaining control over these
devices, cybercriminals can not only attack other devices on a user’s
network but also spy and gather sensitive and personal data." [welivesecurity]
If the company provider of these products do not decide to do it themselves, of course. Take for example "Alexa has been eavesdropping on you this whole time"

- The product is not built by design to respect people's privacy.
- It is owned by a big-tech company.
-
