html/org-pages/ideasx/nlp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-03 Sun 21:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A different aproach to NLP and NLU</title>
<meta name="author" content="Luís Spengler" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">A different aproach to NLP and NLU</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0b03adb">1. NLP</a>
<ul>
<li><a href="#orgc271af0">1.1. Problems</a></li>
</ul>
</li>
<li><a href="#org5f0d2a5">2. Create another language</a>
<ul>
<li><a href="#org437bc19">2.1. Benefits</a></li>
</ul>
</li>
<li><a href="#orgafa89c1">3. New proposal: build a privacy respecting home</a>
<ul>
<li><a href="#org668f9c9">3.1. Links</a></li>
</ul>
</li>
</ul>
</div>
</div>
<ul class="org-ul">
<li>NLP serves as a way to run prebuild functions, and not to make it do something.
<ul class="org-ul">
<li>For it to be able to do something from the words you say</li>
</ul></li>
<li>Running prebuild functions, there are usually more than 10 ways to trigger these to run:
<ul class="org-ul">
<li>Say for example, you wanna ask Alexa the wheather:
<ul class="org-ul">
<li>Alexa, what is the wheather today? - Works</li>
<li>Tell me about the wheather today - Works</li>
<li>I need some information on whether - Quite not the result I wanted</li>
<li>Alexa, am I gonna get wet? - Doesn&rsquo;t work</li>
</ul></li>
</ul></li>
</ul>
<div id="outline-container-org0b03adb" class="outline-2">
<h2 id="org0b03adb"><span class="section-number-2">1.</span> NLP</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc271af0" class="outline-3">
<h3 id="orgc271af0"><span class="section-number-3">1.1.</span> Problems</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>It provides no guarantee - No guarantee of the user receinving what he wants.</li>
<li>It can never perfectly understand human languages (eg. sarcasm)</li>
<li>It is hard to extend</li>
<li>One language dominance (e.g english)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5f0d2a5" class="outline-2">
<h2 id="org5f0d2a5"><span class="section-number-2">2.</span> Create another language</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>New ALI (Audio Language Interface)</li>
<li>Completely undestandable by a computer:
<ul class="org-ul">
<li>There is only one way of input (which means no sarcasm, synonyms, irony, figure of speech)</li>
<li>Grammar is computer instructions</li>
<li>Language can be extensible</li>
<li>It should remove NLP current issues</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org437bc19" class="outline-3">
<h3 id="org437bc19"><span class="section-number-3">2.1.</span> Benefits</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>It is realiable</li>
<li>Easy to be developed</li>
<li>It will provide a standard for programs and voice control supported will be added to every software</li>
<li>Easier for blind people to use computers</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgafa89c1" class="outline-2">
<h2 id="orgafa89c1"><span class="section-number-2">3.</span> New proposal: build a privacy respecting home</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org668f9c9" class="outline-3">
<h3 id="org668f9c9"><span class="section-number-3">3.1.</span> Links</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://www.ctpost.com/business/article/Alexa-has-been-eavesdropping-on-you-this-whole-13822095.php">Alexa has been eavesdropping on you this whole time</a></li>
</ul>


<p>
<a href="https://www.smh.com.au/technology/alexa-is-someone-else-listening-to-us-sometimes-someone-is-20190411-p51d4g.html">&rsquo;Alexa, is someone else listening to us?&rsquo; Sometimes, someone is</a>
<a href="https://www.bnnbloomberg.ca/amazon-s-alexa-reviewers-can-access-customers-home-addresses-1.1248788">Amazon&rsquo;s Alexa reviewers can access customers&rsquo; home addresses</a>
<a href="https://www.welivesecurity.com/2018/02/26/privacy-design-create-safe-smart-home/">Privacy by Design: Can you create a safe smart home?</a>
</p>

<p>
&ldquo;The sensors packed into Smart Home products – with their
microphones, cameras, interface with GPS, not to mention interoperability
– are juicy targets for malware attacks. By gaining control over these
devices, cybercriminals can not only attack other devices on a user’s
network but also spy and gather sensitive and personal data.&rdquo; [welivesecurity]
If the company provider of these products do not decide to do it themselves, of course. Take for example &ldquo;Alexa has been eavesdropping on you this whole time&rdquo;
</p>

<ul class="org-ul">
<li>The product is not built by design to respect people&rsquo;s privacy.</li>
<li>It is owned by a big-tech company.</li>
<li></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luís Spengler</p>
<p class="date">Created: 2022-07-03 Sun 21:09</p>
</div>
</body>
</html>
